{
  "basic_commands": ["open", "close", "start", "stop", "run", "launch", "search", "find", "play", "pause", "resume", "cancel", "delete", "remove", "create", "build", "make", "generate", "write", "read", "speak", "listen", "record", "save", "load", "update", "upgrade", "download", "upload", "send", "call", "message", "reply", "repeat", "refresh", "restart", "shutdown", "sleep", "wake", "mute", "unmute", "increase", "decrease", "turn", "switch", "enable", "disable", "activate", "deactivate"],
  "tech_coding": ["python", "javascript", "react", "node", "html", "css", "api", "server", "database", "frontend", "backend", "fullstack", "github", "git", "terminal", "command", "prompt", "script", "function", "variable", "object", "array", "string", "integer", "boolean", "loop", "class", "method", "module", "package", "library", "framework", "django", "flask", "fastapi", "typescript", "linux", "windows", "ubuntu", "vscode", "cursor", "docker", "cloud", "firebase", "mongodb", "sql", "postgres", "mysql", "cache", "token", "debug", "deploy", "hosting", "render", "vercel", "netlify", "npm", "pip", "json", "yaml", "router", "socket", "kernel", "machinelearning", "dataset", "numpy", "pandas"],
  "ai_assistant": ["jarvis", "assistant", "voice", "recognition", "speech", "microphone", "speaker", "conversation", "memory", "context", "understand", "respond", "reply", "thinking", "reasoning", "smart", "intelligent", "model", "training", "prompting", "chatbot", "automation", "workflow", "transcript", "wakeword", "hotword", "commandmode", "agent", "task", "schedule", "reminder", "calendar", "notes", "translate", "summarize", "analyze", "explain", "recommend", "generateimage", "vision", "camera", "detect", "recognize", "identify", "process", "natural", "language", "learning", "system", "interface", "module", "network", "response", "latency", "stream", "audio", "texttospeech", "speechtotext"],
  "daily_use": ["weather", "today", "tomorrow", "morning", "evening", "night", "time", "clock", "date", "calendar", "news", "sports", "music", "movie", "song", "youtube", "google", "browser", "email", "gmail", "instagram", "whatsapp", "telegram", "facebook", "twitter", "x", "linkedin", "amazon", "flipkart", "shopping", "order", "food", "restaurant", "hotel", "location", "map", "directions", "travel", "train", "flight", "ticket", "uber", "ola", "car", "bike", "petrol", "diesel", "battery", "charge", "electricity", "fan", "light", "door", "window", "room", "home", "office", "school", "college", "market", "money", "bank", "payment", "upi", "phonepe", "gpay", "paytm", "wallet", "camera", "photo", "video", "calling", "contacts", "alarm", "timer"],
  "proper_nouns": ["prince", "raj", "india", "bihar", "patna", "mithapur", "delhi", "mumbai", "kolkata", "bangalore", "hyderabad", "chennai", "openai", "google", "microsoft", "amazon", "meta", "apple", "tesla", "spacex", "nvidia", "intel", "amd", "samsung", "xiaomi", "oneplus", "realme", "oppo", "vivo", "jio", "airtel", "vodafone", "chatgpt", "grok", "gemini", "claude", "jarvis", "tonystark", "marvel", "ironman", "udemy", "leetcode", "github", "youtube", "windows", "linux", "ubuntu", "python", "react", "nodejs", "django", "netflix", "spotify", "oracle", "adobe", "canva"],
  "hard_pronunciation": ["cache", "queue", "query", "azure", "sqlite", "genre", "colonel", "schedule", "either", "neither", "route", "router", "data", "gif", "linux", "sudo", "jwt", "oauth", "regex", "pythonic", "numpy", "pandas", "django", "repo", "github", "gui", "cli", "yaml", "json", "api", "sql", "postgresql", "debian", "ubuntu", "cuda", "kernel", "lambda", "async", "thread", "socket", "binary", "decimal", "matrix", "vector", "gradient", "quantum", "physics", "algorithm", "integer", "boolean", "parameter", "argument", "syntax", "semantic", "phonetic", "microphone", "assistant", "calendar", "analytics", "statistics", "probability", "cryptography", "cybersecurity", "authentication", "authorization", "repository", "environment", "dependency", "package", "compiler", "interpreter", "virtualization", "automation", "architecture", "infrastructure", "bandwidth", "latency", "throughput"]
}
